app/controllers/restaurants_controller.rb

  def all
    render json: Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"