app/controllers/restaurants_controller.rb

  def index
    render json: Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def show
    render json: Restaurant.find(params.require(:id))
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    restaurant = Restaurant.create!(name: params.require(:name),
                          address: params.require(:address),
                          does_accept_10bis: params.require(:does_accept_10bis),
                          delivery_sla_in_minutes: params.require(:delivery_sla_in_minutes),
                          cuisine_id: params.require(:cuisine_id))
---
INSERT INTO "restaurants" ("name", "rating", "cuisine", "delivery_sla_in_minutes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Rest1"], ["rating", 2], ["cuisine", "cuis1"], ["delivery_sla_in_minutes", 15], ["created_at", "2017-09-19 14:12:27.351752"], ["updated_at", "2017-09-19 14:12:27.351752"]]

  def update
    render json: Restaurant.find(params.require(:id)).update(params.permit(:name, :address, :does_accept_10bis, :delivery_sla_in_minutes))
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "delivery_sla_in_minutes" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "zzz"], ["delivery_sla_in_minutes", 200], ["updated_at", "2017-09-25 15:25:18.045687"], ["id", 4]]